Documents/СнятиеДисциплинарногоВзыскания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СнятиеДисциплинарногоВзыскания</Name>
			<BasedOn>
				<xr:Item>Document.ДисциплинарноеВзыскание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДисциплинарноеВзыскание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДисциплинарноеВзыскание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДисциплинарноеВзыскание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.СведенияОДисциплинарныхВзысканиях</xr:Item>
				<xr:Item>InformationRegister.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников</xr:Item>
				<xr:Item>InformationRegister.БухучетНачисленийСотрудников</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Взыскание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРаботникаКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьНаставничество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Взыскание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Взыскания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Наставники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставляемый</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеНаставника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтменитьДоплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СнятиеДисциплинарногоВзыскания/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДисциплинарноеВзыскание") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьПоДокументуОснованию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.СнятиеДисциплинарногоВзыскания.ПолучитьДанныеДляПроведения(Ссылка);
	
	ДисциплинарныеВзыскания.СформироватьДвиженияДисциплинарногоВзыскания(Движения, ДанныеДляПроведения.ДвиженияДисциплинарногоВзыскания);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Сотрудники.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Организация", Организация);
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(Запрос.МенеджерВременныхТаблиц, Сотрудники.Выгрузить(), "ВТСнимаемыеВзыскания");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
		|	СнимаемыеВзыскания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СнимаемыеВзыскания.Взыскание КАК Взыскание,
		|	СнимаемыеВзыскания.ДатаНачала КАК ДатаНачала,
		|	СнимаемыеВзыскания.ДатаСнятия КАК Период
		|ПОМЕСТИТЬ ВТИзмеренияДаты
		|ИЗ
		|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания";
		Запрос.Выполнить();
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
			|	СнимаемыеВзыскания.Взыскание КАК Взыскание
			|ИЗ
			|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание.Сотрудники КАК СотрудникиОснования
			|		ПО (СотрудникиОснования.Ссылка = &ДокументОснование)
			|			И СнимаемыеВзыскания.Сотрудник = СотрудникиОснования.Сотрудник
			|			И СнимаемыеВзыскания.Взыскание = СотрудникиОснования.Взыскание
			|ГДЕ
			|	СотрудникиОснования.Сотрудник ЕСТЬ NULL";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru='Сотрудник %1 с взысканием %2 отсутствует в документе-основании %3'"),
						Выборка.Сотрудник, Выборка.Взыскание, ДокументОснование),
						Ссылка,,"Объект", Отказ);
						
			КонецЦикла;
		КонецЕсли;
		
		СоздатьВТСведенияОДисциплинарныхВзысканиях(Ссылка,Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
			|	СнимаемыеВзыскания.ДатаСнятия КАК ДатаСнятия,
			|	СнимаемыеВзыскания.Взыскание КАК Взыскание
			|ИЗ
			|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДисциплинарныхВзысканиях КАК Взыскания
			|		ПО СнимаемыеВзыскания.Сотрудник = Взыскания.Сотрудник
			|			И СнимаемыеВзыскания.Взыскание = Взыскания.Взыскание
			|			И СнимаемыеВзыскания.ДатаНачала = Взыскания.ДатаНачала
			|ГДЕ
			|	Взыскания.ДатаОкончания ЕСТЬ NULL";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru='Для сотрудника %1 нет действующего взыскания %2 на %3'"),
					Выборка.Сотрудник, Выборка.Взыскание, Формат(Выборка.ДатаСнятия, "ДЛФ=DD")),
					Ссылка,,"Объект", Отказ);
					
			
		КонецЦикла;
	
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Список сотрудников на снятие взыскания не может быть пустым'"), , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТСведенияОДисциплинарныхВзысканиях(ИсключаемыйРегистратор,МенеджерВременныхТаблиц,ТаблицаФильтра = "ВТИзмеренияДаты")
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних("СведенияОДисциплинарныхВзысканиях", МенеджерВременныхТаблиц, Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ТаблицаФильтра, "Организация,Сотрудник,Взыскание,ДатаНачала"), ПараметрыПостроения,"ВТСведенияОДисциплинарныхВзысканиях");
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию() Экспорт
	
	ДанныеОснования = ДанныеДокументаОснования();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОснования);
	Сотрудники.Очистить();
	
	Для каждого ДанныеСотрудника Из ДанныеОснования.Сотрудники Цикл
		Приемник = Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(Приемник, ДанныеСотрудника);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДокументаОснования()
	
	ДанныеОснования = Новый Структура("Организация,ДатаСобытия,Сотрудники",Справочники.Организации.ПустаяСсылка(),Дата(1,1,1),Новый Массив());
	ДанныеОснования.ДатаСобытия = ?(ЗначениеЗаполнено(ДатаСобытия), ДатаСобытия, ТекущаяДата());

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДанныеОснования.Организация = ДокументОснование.Организация;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
		Запрос.УстановитьПараметр("ДатаАктуальности",ДанныеОснования.ДатаСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДисциплинарноеВзыскание.Организация КАК Организация,
		|	ДисциплинарноеВзысканиеСотрудники.Ссылка КАК Ссылка,
		|	ДисциплинарноеВзысканиеСотрудники.Сотрудник КАК Сотрудник,
		|	ДисциплинарноеВзысканиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДисциплинарноеВзысканиеСотрудники.Взыскание КАК Взыскание,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаНачала КАК ДатаНачала,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаОкончания КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиОснования
		|ИЗ
		|	Документ.ДисциплинарноеВзыскание.Сотрудники КАК ДисциплинарноеВзысканиеСотрудники
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание КАК ДисциплинарноеВзыскание
		|		ПО ДисциплинарноеВзысканиеСотрудники.Ссылка = ДисциплинарноеВзыскание.Ссылка
		|ГДЕ
		|	ДисциплинарноеВзысканиеСотрудники.Ссылка = &Ссылка";
		Запрос.Выполнить();
		
		СоздатьВТСведенияОДисциплинарныхВзысканиях(ДокументОснование,Запрос.МенеджерВременныхТаблиц,"ВТСотрудникиОснования");
		
		КадровыеДанные = "ДатаУвольнения";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОснования");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОснования.Сотрудник КАК Сотрудник,
		|	СотрудникиОснования.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиОснования.Взыскание КАК Взыскание,
		|	СотрудникиОснования.ДатаНачала КАК ДатаНачала,
		|	&ДатаАктуальности КАК ДатаСнятия
		|ИЗ
		|	ВТСотрудникиОснования КАК СотрудникиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО СотрудникиОснования.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДисциплинарныхВзысканиях КАК Взыскания
		|		ПО СотрудникиОснования.Сотрудник = Взыскания.Сотрудник
		|			И СотрудникиОснования.ФизическоеЛицо = Взыскания.ФизическоеЛицо
		|			И СотрудникиОснования.Взыскание = Взыскания.Взыскание
		|			И СотрудникиОснования.ДатаНачала = Взыскания.ДатаНачала
		|ГДЕ
		|	Взыскания.ДатаОкончания ЕСТЬ NULL
		|	И (КадровыеДанныеСотрудников.ДатаУвольнения >= &ДатаАктуальности
		|			ИЛИ КадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеСотрудника = Новый Структура("Сотрудник, ФизическоеЛицо, Взыскание, ДатаНачала, ДатаСнятия");
			ЗаполнитьЗначенияСвойств(ДанныеСотрудника, Выборка);
			ДанныеОснования.Сотрудники.Добавить(ДанныеСотрудника);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДанныеОснования;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
